<?php
/**
 * 提示消息语言文件
 *
 * 命名前缀：s_：成功，e_：失败，l_：列表
 *
 * 统一信息提示：前缀_提示词
 * 针对性信息提示：前缀_所处控制器全名或简写_提示词
 */
return [
	// 统一信息提示
	'e_params' => '参数错误。',
	'e_nodata' => '没有找到匹配的数据',
	'l_back' => '返回上一页',
	'l_back_list' => '返回列表',
	'l_back_edit' => '重新编辑',
	's_store' => '保存成功',
	's_add' => '添加成功。',
	's_edit' => '更新成功。',
	's_del' => '删除成功。',
	's_operate' => '操作成功。',
	'e_store' => '保存失败',
	'e_add' => '添加失败，请重试。',
	'e_edit' => '更新失败，请重试。',
	'e_del' => '删除失败，请重试。',
	'e_operate' => '操作失败，请稍后重试。',
	'e_noprivs' => '您没有访问当前功能的权限，请联系管理员。',

	// 针对性信息提示
	'e_usergroup_hasuser' => '该用户组中有管理员，不能删除',
	'e_category_haschild' => '该分类下有子分类，不能删除',
	'e_category_hasdata' => '该分类下有数据，不能删除',
	'e_adminusers_password' => '原密码错误',
];